[M_IrisEp5Battle_FlyboyGyro MissionDefinition]
MissionDescription="As it stands, Flyboy has no reason to fight you -- he thinks he's invincible, and he's more focused on taking out Piston than scuffling with lower-ranked fighters like you.<br><br>Mister Torgue suggested that you mess up some of Flyboy's buzzards and steal his toys. Once you've done that, Flyboy will get furious and, because he is stupid, allow you into his lair so he can kill you.<br><br>But you'll actually kill HIM. That's the TWIST."
TurnInDescription="Flyboy's buzzards are dead, and he's pissed -- so pissed, in fact, that he's invited you into his lair so he can kill you personally."
MissionSummary="Kill Flyboy's buzzards and steal his bling."

[M_IrisEp5Battle_FlyboyGyro2 MissionDefinition]
MissionDescription="Destroy the crates on the cargo buzzards and pick up the bling that falls out.  Also blow up all the support buzzards that attack you.<br><br>Tier 2 Difficulty."
MissionSummary="Kill buzzards and steal their bling. Tier 2 Difficulty."

[M_IrisEp5Battle_FlyboyGyro2:KillFlyboyGyros_Tier2 MissionObjectiveDefinition]
ProgressMessage="Kill all escort buzzards"

[M_IrisEp5Battle_FlyboyGyro2:ReachBattleStartPoint MissionObjectiveDefinition]
ProgressMessage="Gather at rally point"

[M_IrisEp5Battle_FlyboyGyro3 MissionDefinition]
MissionDescription="Destroy the crates on the cargo buzzards and pick up the bling that falls out.  Also blow up all the support buzzards that attack you.<br><br>Tier 3 Difficulty."
MissionSummary="Kill buzzards and steal their bling. Tier 3 Difficulty."

[M_IrisEp5Battle_FlyboyGyro3:KillFlyboyGyros_Tier3 MissionObjectiveDefinition]
ProgressMessage="Kill all escort buzzards"

[M_IrisEp5Battle_FlyboyGyro3:ReachBattleStartPoint MissionObjectiveDefinition]
ProgressMessage="Gather at rally point"

[M_IrisEp5Battle_FlyboyGyro:KillFlyboyGyros_Tier1 MissionObjectiveDefinition]
ProgressMessage="Kill all escort buzzards"

[M_IrisEp5Battle_FlyboyGyro:ReachBattleStartPoint MissionObjectiveDefinition]
ProgressMessage="Gather at rally point"

[M_IrisEp5Battle_FlyboyGyroR3 MissionDefinition]
MissionDescription="Destroy the crates on the cargo buzzards and pick up the bling that falls out.  Also blow up all the support buzzards that attack you.<br><br>Tier 3 Difficulty."
MissionSummary="Kill buzzards and steal their bling. Tier 3 Difficulty."

[M_IrisEp5Battle_FlyboyGyroR3:KillFlyboyGyros_Tier3 MissionObjectiveDefinition]
ProgressMessage="Kill all escort buzzards"

[M_IrisEp5Battle_FlyboyGyroR3:ReachBattleStartPoint MissionObjectiveDefinition]
ProgressMessage="Gather at rally point"
